src/cf/Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыЗаказовПокупателей/Forms/ФормаСпискаЭтапов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
		Если  ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Справочники.СостоянияЗаказовПокупателей) Тогда
			Элементы.ФормаСоздать.Видимость = Истина;
		КонецЕсли;
 	Иначе
 		Элементы.ФормаДобавитьСостояние.Видимость = Ложь;
 	КонецЕсли;

	ВидЗаказа = Параметры.ВидЗаказа;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
		Заголовок = СтрШаблон(Заголовок, Строка(ВидЗаказа));
	Иначе
		Заголовок = НСтр("ru='Состояния заказа покупателя'");				
	КонецЕсли;
		
	СписокСостояний.Параметры.УстановитьЗначениеПараметра("ВидЗаказа", ВидЗаказа);
	
	СписокСостояний.Порядок.Элементы.Очистить();
	
	Порядок = СписокСостояний.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Порядок.Использование = Истина;
	Порядок.Поле = Новый ПолеКомпоновкиДанных("ЗавершенПоследним");
	Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	Порядок = СписокСостояний.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	Порядок.Использование = Истина;
	Порядок.Поле = Новый ПолеКомпоновкиДанных("НомерСтроки");
	Порядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	
	ИспользоватьПроцессыСостояний = ПолучитьФункциональнуюОпцию("ИспользоватьПроцессыСостояний");
	Элементы.ГруппаПодсказка.Видимость = ИспользоватьПроцессыСостояний;
	
	СохранитьГлобальныеНастройки();
	ИзменитьТекстЗапросаПоПараметрам(Параметры);
	УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СостоянияЗаказовПокупателей" Тогда
		Если Параметр.Свойство("ЭтоНовый") И Параметр.Свойство("Ссылка") И Параметр.ЭтоНовый Тогда
			Если Источник.ВладелецФормы = Элементы.СписокЭтапов Тогда
				ДобавитьСостояниеЗаказа(ВидЗаказа, Параметр.Ссылка);
			КонецЕсли;
		КонецЕсли;
		УстановитьУсловноеОформлениеПоЦветамСостоянийСервер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЭтапов

&НаКлиенте
Процедура СписокЭтаповОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ДобавитьСостояниеЗаказа(ВидЗаказа, ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокЭтаповПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		Данные = СтрокаСписка.Значение.Данные;
		СтрокаПредставления = Строка(Данные.НомерСтроки) + ". " + Данные.Наименование;  
		Данные.ПредставлениеНаименования = СтрокаПредставления;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСостояние(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
		
	ОткрытьФорму("Справочник.СостоянияЗаказовПокупателей.ФормаВыбора", ПараметрыФормы, Элементы.СписокЭтапов);

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	
	ПереместитьЭлемент(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	
	ПереместитьЭлемент(1);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьТекстЗапросаПоПараметрам(Параметры)
	
	Если Не Параметры.Свойство("ОтображатьСостоянияЗаявок") И ЗаявкиИспользуются Тогда
		
		СписокСостояний.ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ПорядокСостояний.Состояние КАК Состояние,
			|	МИНИМУМ(ПорядокСостояний.НомерСтроки) КАК НомерСтроки
			|ПОМЕСТИТЬ ВТ_ПорядокСостояний
			|ИЗ
			|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ПорядокСостояний
			|ГДЕ
			|	ПорядокСостояний.Ссылка = &ВидЗаказа
			|	И ПорядокСостояний.НомерСтроки > ПорядокСостояний.Ссылка.НомерСостоянияЗаявки
			|
			|СГРУППИРОВАТЬ ПО
			|	ПорядокСостояний.Состояние
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СостоянияЗаказовПокупателей.Ссылка КАК Ссылка,
			|	СостоянияЗаказовПокупателей.Наименование КАК Наименование,
			|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ПредставлениеНаименования,
			|	ВТ_ПорядокСостояний.НомерСтроки КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА СостоянияЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.Завершен)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ЗавершенПоследним
			|ИЗ
			|	ВТ_ПорядокСостояний КАК ВТ_ПорядокСостояний
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
			|		ПО ВТ_ПорядокСостояний.Состояние = СостоянияЗаказовПокупателей.Ссылка";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьГлобальныеНастройки()
	
	ЗаявкиИспользуются = РаботаСЗаявками.ЗаявкиИспользуются(, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеПоЦветамСостоянийСервер()
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеПоЦветамСостояний(СписокСостояний.КомпоновщикНастроек.Настройки.УсловноеОформление,
		Метаданные.Справочники.СостоянияЗаказовПокупателей.ПолноеИмя(),
		"Ссылка");
	
	СостоянияЗаказов.УстановитьУсловноеОформлениеСостоянияЗавершен(СписокСостояний.КомпоновщикНастроек.Настройки.УсловноеОформление,
		ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен"));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСостояниеЗаказа(ВидЗаказа, СостояниеЗаказа)
	
	Если ВидЗаказа.ПорядокСостояний.НайтиСтроки(Новый Структура("Состояние", СостояниеЗаказа)).Количество() > 0 Тогда				
		Возврат;		
	КонецЕсли;
	
	ВидЗаказаОбъект = ВидЗаказа.ПолучитьОбъект();
	ВидЗаказаОбъект.Заблокировать();
	НоваяСтрока = ВидЗаказаОбъект.ПорядокСостояний.Добавить();
	НоваяСтрока.Состояние = СостояниеЗаказа;
	ВидЗаказаОбъект.Записать();
		
	Элементы.СписокЭтапов.Обновить();
			
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлемент(Смещение)
	
	Если Не ЗначениеЗаполнено(Элементы.СписокЭтапов.ТекущаяСтрока)
		Или Элементы.СписокЭтапов.ТекущаяСтрока = ПредопределенноеЗначение("Справочник.СостоянияЗаказовПокупателей.Завершен") Тогда
		
		Возврат;
	КонецЕсли;
	
	СостоянияЗаказовВызовСервера.ПереместитьСостояние(ВидЗаказа,
		Элементы.СписокЭтапов.ТекущаяСтрока,
		Смещение);
	Элементы.СписокЭтапов.Обновить();
	
	Оповестить("Запись_ВидыЗаказовПокупателей", ВидЗаказа, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеПроцессов(Команда) 
	ПараметрыПроцессов = Новый Структура;
	ПараметрыПроцессов.Вставить("НастройкаПроцессов", Истина);
	ПараметрыПроцессов.Вставить("Ключ", ВидЗаказа);
	ОткрытьФорму("Справочник.ВидыЗаказовПокупателей.Форма.ФормаЭлемента", ПараметрыПроцессов);
КонецПроцедуры

#КонецОбласти
